[Killed] LogicalOperator
src/transcriptService.ts:59:55
     // unnecessarily clever way to validate the existence of a transcript:
     // throws error if not found or doesn't match
     getIndex(studentID: StudentID, name: StudentName): number {
-        const index = this.transcripts.findIndex(t => t.studentID === studentID && t.studentName === name)
+        const index = this.transcripts.findIndex(t => t.studentID === studentID || t.studentName === name)
         if (index === -1) {
             throw new Error("Transcript not found for the given ID and name");
killedBy: Index Retrieval shoudl throw an error if ID is correct but name does not match.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Transcript not found for the given ID and name"

Received function did not throw
