[Killed] BlockStatement
src/transcriptService.ts:17:33
     */
     // changed from 0 to 1 to fix "should be a positive integer" test
     private lastID: StudentID = 1  // this should be private to nextID().
-    private nextID(): StudentID { return this.lastID++ }
+    private nextID(): StudentID {}
 
     constructor() { }
killedBy: TranscriptService Create student should return an ID, starting with 1
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] UpdateOperator
src/transcriptService.ts:17:42
     */
     // changed from 0 to 1 to fix "should be a positive integer" test
     private lastID: StudentID = 1  // this should be private to nextID().
-    private nextID(): StudentID { return this.lastID++ }
+    private nextID(): StudentID { return this.lastID-- }
 
     constructor() { }

[Killed] BlockStatement
src/transcriptService.ts:24:56
     /** Initializes the database with an array of transcripts
      * @param {Transcript[]} initialTranscripts - the initial transcripts to populate the database
      */
-    initialize(initialTranscripts: Transcript[]): void {
-        this.transcripts = initialTranscripts;
-    }
+    initialize(initialTranscripts: Transcript[]): void {}
 
     /** Adds a new student to the database
killedBy: TranscriptService getStudentIDsByName Should return only the students who match the name
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   1,
    3,

[Killed] BlockStatement
src/transcriptService.ts:32:44
      * @param {string} newName - the name of the student
      * @returns {StudentID} - the newly-assigned ID for the new student
      */
-    addStudent(newName: string): StudentID {
-        const newID: StudentID = this.nextID()
-        const newTranscript: Transcript = {
-            studentID: newID,
-            studentName: newName,
-            courses: [] // initially no courses
-        };
-        this.transcripts.push(newTranscript)
-        return newID
-    }
+    addStudent(newName: string): StudentID {}
 
 
killedBy: TranscriptService Create student should return an ID, starting with 1
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArrayDeclaration
src/transcriptService.ts:37:22
         const newTranscript: Transcript = {
             studentID: newID,
             studentName: newName,
-            courses: [] // initially no courses
+            courses: ["Stryker was here"] // initially no courses
         };
         this.transcripts.push(newTranscript)
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 3.5
Received: NaN

Expected precision:    1
Expected difference: < 0.05
Received difference:   NaN

[Killed] BlockStatement
src/transcriptService.ts:48:59
      * @param studentName 
      * @returns list of studentIDs associated with that name
      */
-    getStudentIDsByName(studentName: string): StudentID[] {
-        return this.transcripts
-            .filter(t => t.studentName === studentName)
-            .map(t => t.studentID)
-    }
+    getStudentIDsByName(studentName: string): StudentID[] {}
 
 
killedBy: TranscriptService getStudentIDsByName Should return only the students who match the name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2]
Received: undefined

[Killed] MethodExpression
src/transcriptService.ts:49:16
      * @returns list of studentIDs associated with that name
      */
     getStudentIDsByName(studentName: string): StudentID[] {
-        return this.transcripts
-            .filter(t => t.studentName === studentName)
+        return this.transcripts
             .map(t => t.studentID)
     }
killedBy: TranscriptService getStudentIDsByName Should return only the students who match the name
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
    2,

[Killed] EqualityOperator
src/transcriptService.ts:50:26
      */
     getStudentIDsByName(studentName: string): StudentID[] {
         return this.transcripts
-            .filter(t => t.studentName === studentName)
+            .filter(t => t.studentName !== studentName)
             .map(t => t.studentID)
     }
killedBy: TranscriptService getStudentIDsByName Should return only the students who match the name
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Array [
-   1,
-   2,

[Killed] ArrowFunction
src/transcriptService.ts:50:21
      */
     getStudentIDsByName(studentName: string): StudentID[] {
         return this.transcripts
-            .filter(t => t.studentName === studentName)
+            .filter(() => undefined)
             .map(t => t.studentID)
     }
killedBy: TranscriptService getStudentIDsByName Should return only the students who match the name
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] ArrowFunction
src/transcriptService.ts:51:18
     getStudentIDsByName(studentName: string): StudentID[] {
         return this.transcripts
             .filter(t => t.studentName === studentName)
-            .map(t => t.studentID)
+            .map(() => undefined)
     }
 
killedBy: TranscriptService getStudentIDsByName Should return only the students who match the name
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/transcriptService.ts:58:63
 
     // unnecessarily clever way to validate the existence of a transcript:
     // throws error if not found or doesn't match
-    getIndex(studentID: StudentID, name: StudentName): number {
-        const index = this.transcripts.findIndex(t => t.studentID === studentID && t.studentName === name)
-        if (index === -1) {
-            throw new Error("Transcript not found for the given ID and name");
-        } else {
-            return index
-        }
-    }
+    getIndex(studentID: StudentID, name: StudentName): number {}
 
     getTranscript(studentID: StudentID, name: StudentName): Transcript {
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: TypeError: Cannot read properties of undefined (reading 'courses')

[Killed] EqualityOperator
src/transcriptService.ts:59:84
     // unnecessarily clever way to validate the existence of a transcript:
     // throws error if not found or doesn't match
     getIndex(studentID: StudentID, name: StudentName): number {
-        const index = this.transcripts.findIndex(t => t.studentID === studentID && t.studentName === name)
+        const index = this.transcripts.findIndex(t => t.studentID === studentID && t.studentName !== name)
         if (index === -1) {
             throw new Error("Transcript not found for the given ID and name");
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: Transcript not found for the given ID and name

[Killed] EqualityOperator
src/transcriptService.ts:59:55
     // unnecessarily clever way to validate the existence of a transcript:
     // throws error if not found or doesn't match
     getIndex(studentID: StudentID, name: StudentName): number {
-        const index = this.transcripts.findIndex(t => t.studentID === studentID && t.studentName === name)
+        const index = this.transcripts.findIndex(t => t.studentID !== studentID && t.studentName === name)
         if (index === -1) {
             throw new Error("Transcript not found for the given ID and name");
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: Transcript not found for the given ID and name

[Killed] BlockStatement
src/transcriptService.ts:60:27
     // throws error if not found or doesn't match
     getIndex(studentID: StudentID, name: StudentName): number {
         const index = this.transcripts.findIndex(t => t.studentID === studentID && t.studentName === name)
-        if (index === -1) {
-            throw new Error("Transcript not found for the given ID and name");
-        } else {
+        if (index === -1) {} else {
             return index
         }
killedBy: TranscriptService Deleting students Should result in the students' transcript no longer being available
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/transcriptService.ts:60:13
     // throws error if not found or doesn't match
     getIndex(studentID: StudentID, name: StudentName): number {
         const index = this.transcripts.findIndex(t => t.studentID === studentID && t.studentName === name)
-        if (index === -1) {
+        if (true) {
             throw new Error("Transcript not found for the given ID and name");
         } else {
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: Transcript not found for the given ID and name

[Killed] BlockStatement
src/transcriptService.ts:62:16
         const index = this.transcripts.findIndex(t => t.studentID === studentID && t.studentName === name)
         if (index === -1) {
             throw new Error("Transcript not found for the given ID and name");
-        } else {
-            return index
-        }
+        } else {}
     }
 
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: TypeError: Cannot read properties of undefined (reading 'courses')

[Killed] BlockStatement
src/transcriptService.ts:67:72
         }
     }
 
-    getTranscript(studentID: StudentID, name: StudentName): Transcript {
-        const index = this.getIndex(studentID, name)
-        // throws error if not found or doesn't match
-        return this.transcripts[index]
-    }
+    getTranscript(studentID: StudentID, name: StudentName): Transcript {}
 
 
killedBy: TranscriptService Deleting students Should result in the students' transcript no longer being available
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/transcriptService.ts:80:66
      * @throws {Error} if the transcript is not found for deletion
      */
 
-    deleteStudent(studentID: StudentID, name: StudentName): void {
-        const index = this.getIndex(studentID, name)
-        // throws error if not found or doesn't match, so index is guaranteed to be valid
-        this.transcripts.splice(index, 1); // remove the transcript from the array
-    }
+    deleteStudent(studentID: StudentID, name: StudentName): void {}
 
     getGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID): Grade {
killedBy: TranscriptService Deleting students Should result in the students' transcript no longer being available
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/transcriptService.ts:86:89
         this.transcripts.splice(index, 1); // remove the transcript from the array
     }
 
-    getGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID): Grade {
-        const index = this.getIndex(studentID, studentName)
-        const courses = this.transcripts[index].courses; 
-        const course = courses.find(c => c.courseID === courseID);
-        if (!course) {
-            throw new Error(`Course with ID ${courseID} not found for student ${studentName} (ID: ${studentID})`);
-        }
-        return course.grade; // return the grade for the course
-    }
+    getGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID): Grade {}
 
     addGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID, grade: Grade): void {
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Killed] ArrowFunction
src/transcriptService.ts:89:37
     getGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID): Grade {
         const index = this.getIndex(studentID, studentName)
         const courses = this.transcripts[index].courses; 
-        const course = courses.find(c => c.courseID === courseID);
+        const course = courses.find(() => undefined);
         if (!course) {
             throw new Error(`Course with ID ${courseID} not found for student ${studentName} (ID: ${studentID})`);
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: Course with ID test course not found for student test student (ID: 1)

[Killed] EqualityOperator
src/transcriptService.ts:89:42
     getGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID): Grade {
         const index = this.getIndex(studentID, studentName)
         const courses = this.transcripts[index].courses; 
-        const course = courses.find(c => c.courseID === courseID);
+        const course = courses.find(c => c.courseID !== courseID);
         if (!course) {
             throw new Error(`Course with ID ${courseID} not found for student ${studentName} (ID: ${studentID})`);
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: Course with ID test course not found for student test student (ID: 1)

[Killed] ConditionalExpression
src/transcriptService.ts:90:13
         const index = this.getIndex(studentID, studentName)
         const courses = this.transcripts[index].courses; 
         const course = courses.find(c => c.courseID === courseID);
-        if (!course) {
+        if (true) {
             throw new Error(`Course with ID ${courseID} not found for student ${studentName} (ID: ${studentID})`);
         }
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: Course with ID test course not found for student test student (ID: 1)

[Killed] BooleanLiteral
src/transcriptService.ts:90:13
         const index = this.getIndex(studentID, studentName)
         const courses = this.transcripts[index].courses; 
         const course = courses.find(c => c.courseID === courseID);
-        if (!course) {
+        if (course) {
             throw new Error(`Course with ID ${courseID} not found for student ${studentName} (ID: ${studentID})`);
         }
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: Course with ID test course not found for student test student (ID: 1)

[Killed] BlockStatement
src/transcriptService.ts:96:102
         return course.grade; // return the grade for the course
     }
 
-    addGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID, grade: Grade): void {
-        const index = this.getIndex(studentID, studentName)
-        // throws error if not found or doesn't match, so index is guaranteed to be valid
-        // would .concat({courseID, grade}) work here?
-        const transcript = this.transcripts[index].courses.push({ courseID: courseID, grade: grade });
-    }
+    addGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID, grade: Grade): void {}
 
     getAll(): Transcript[] {
killedBy: TranscriptService Adding grades should add the grade to the transcript
statusReason: Error: Course with ID test course not found for student test student (ID: 1)

[Killed] BlockStatement
src/transcriptService.ts:103:28
         const transcript = this.transcripts[index].courses.push({ courseID: courseID, grade: grade });
     }
 
-    getAll(): Transcript[] {
-        return this.transcripts; // return the entire transcripts array
-    }
+    getAll(): Transcript[] {}
 
     getGPA(studentID: StudentID, studentName: StudentName): number {
killedBy: TranscriptService getAll Should return the transcripts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/transcriptService.ts:107:68
         return this.transcripts; // return the entire transcripts array
     }
 
-    getGPA(studentID: StudentID, studentName: StudentName): number {
-        const transcript = this.getTranscript(studentID, studentName);
-        if (transcript.courses.length === 0) {
-            throw new Error("No courses found for GPA calculation");
-        }
-        const grades = transcript.courses.map(c => c.grade);
-        const total = grades.reduce((acc, grade) => acc + grade, 0);
-        const avg = total / grades.length;
-        return avg / 25; // Convert to GPA scale
-    }
+    getGPA(studentID: StudentID, studentName: StudentName): number {}
 
     isEnrolled(studentID: StudentID, studentName: StudentName, courseID: CourseID): boolean {
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: TypeError: expect(received).toBeCloseTo(expected, precision)

Matcher error: received value must be a number

Received has value: undefined

[Killed] EqualityOperator
src/transcriptService.ts:109:13
 
     getGPA(studentID: StudentID, studentName: StudentName): number {
         const transcript = this.getTranscript(studentID, studentName);
-        if (transcript.courses.length === 0) {
+        if (transcript.courses.length !== 0) {
             throw new Error("No courses found for GPA calculation");
         }
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: Error: No courses found for GPA calculation

[Killed] ConditionalExpression
src/transcriptService.ts:109:13
 
     getGPA(studentID: StudentID, studentName: StudentName): number {
         const transcript = this.getTranscript(studentID, studentName);
-        if (transcript.courses.length === 0) {
+        if (true) {
             throw new Error("No courses found for GPA calculation");
         }
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: Error: No courses found for GPA calculation

[NoCoverage] StringLiteral
src/transcriptService.ts:110:29
     getGPA(studentID: StudentID, studentName: StudentName): number {
         const transcript = this.getTranscript(studentID, studentName);
         if (transcript.courses.length === 0) {
-            throw new Error("No courses found for GPA calculation");
+            throw new Error("");
         }
         const grades = transcript.courses.map(c => c.grade);

[Killed] ArrowFunction
src/transcriptService.ts:112:47
         if (transcript.courses.length === 0) {
             throw new Error("No courses found for GPA calculation");
         }
-        const grades = transcript.courses.map(c => c.grade);
+        const grades = transcript.courses.map(() => undefined);
         const total = grades.reduce((acc, grade) => acc + grade, 0);
         const avg = total / grades.length;
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 3.5
Received: NaN

Expected precision:    1
Expected difference: < 0.05
Received difference:   NaN

[Killed] ArrowFunction
src/transcriptService.ts:113:37
             throw new Error("No courses found for GPA calculation");
         }
         const grades = transcript.courses.map(c => c.grade);
-        const total = grades.reduce((acc, grade) => acc + grade, 0);
+        const total = grades.reduce(() => undefined, 0);
         const avg = total / grades.length;
         return avg / 25; // Convert to GPA scale
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 3.5
Received: NaN

Expected precision:    1
Expected difference: < 0.05
Received difference:   NaN

[Killed] ArithmeticOperator
src/transcriptService.ts:113:53
             throw new Error("No courses found for GPA calculation");
         }
         const grades = transcript.courses.map(c => c.grade);
-        const total = grades.reduce((acc, grade) => acc + grade, 0);
+        const total = grades.reduce((acc, grade) => acc - grade, 0);
         const avg = total / grades.length;
         return avg / 25; // Convert to GPA scale
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 3.5
Received: -3.5

Expected precision:    1
Expected difference: < 0.05
Received difference:   7

[Killed] ArithmeticOperator
src/transcriptService.ts:114:21
         }
         const grades = transcript.courses.map(c => c.grade);
         const total = grades.reduce((acc, grade) => acc + grade, 0);
-        const avg = total / grades.length;
+        const avg = total * grades.length;
         return avg / 25; // Convert to GPA scale
     }
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 3.5
Received: 14

Expected precision:    1
Expected difference: < 0.05
Received difference:   10.5

[Killed] ArithmeticOperator
src/transcriptService.ts:115:16
         const grades = transcript.courses.map(c => c.grade);
         const total = grades.reduce((acc, grade) => acc + grade, 0);
         const avg = total / grades.length;
-        return avg / 25; // Convert to GPA scale
+        return avg * 25; // Convert to GPA scale
     }
 
killedBy: TranscriptService getGPA should compute GPA correctly for multiple courses
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 3.5
Received: 2187.5

Expected precision:    1
Expected difference: < 0.05
Received difference:   2184

[Killed] BlockStatement
src/transcriptService.ts:118:93
         return avg / 25; // Convert to GPA scale
     }
 
-    isEnrolled(studentID: StudentID, studentName: StudentName, courseID: CourseID): boolean {
-        const transcript = this.getTranscript(studentID, studentName);
-        return transcript.courses.some(c => c.courseID === courseID);
-    }
+    isEnrolled(studentID: StudentID, studentName: StudentName, courseID: CourseID): boolean {}
 }
 
killedBy: TranscriptService isEnrolled should return true if the student is enrolled in the course
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/transcriptService.ts:120:45
 
     isEnrolled(studentID: StudentID, studentName: StudentName, courseID: CourseID): boolean {
         const transcript = this.getTranscript(studentID, studentName);
-        return transcript.courses.some(c => c.courseID === courseID);
+        return transcript.courses.some(c => false);
     }
 }
killedBy: TranscriptService isEnrolled should return true if the student is enrolled in the course
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/transcriptService.ts:120:45
 
     isEnrolled(studentID: StudentID, studentName: StudentName, courseID: CourseID): boolean {
         const transcript = this.getTranscript(studentID, studentName);
-        return transcript.courses.some(c => c.courseID === courseID);
+        return transcript.courses.some(c => c.courseID !== courseID);
     }
 }
killedBy: TranscriptService isEnrolled should return true if the student is enrolled in the course
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
